# BuiltInFailures.OffsetFacesCellLegacyFailures Class

---
Failures related to offset faces operations.
SystemObject Autodesk.Revit.DBBuiltInFailuresOffsetFacesCellLegacyFailures
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public static class OffsetFacesCellLegacyFailures

    Public NotInheritable Class OffsetFacesCellLegacyFailures

    public ref class OffsetFacesCellLegacyFailures abstract sealed

    [<AbstractClassAttribute>]
    [<SealedAttribute>]
    type OffsetFacesCellLegacyFailures = class end
The BuiltInFailuresOffsetFacesCellLegacyFailures type exposes the following members.
| Name| Description
---|---|---
| OffsetFaceFailed|
Top
#### Reference
Autodesk.Revit.DB Namespace